{"posts":[{"title":"关于此站","text":"写在前面​ 芜湖！终于建好了自己的博客网站！日后会在上面不定期发一些自己想写或者想分享的内容，希望有人能常来这里看看(不切实际的幻想）。如果有人喜欢的话（羞），马上会把RSS订阅给做出来，这样就可以将文章推送到你的邮箱里。 建站目的​ 本人普通学生，不想写作业不想打太多游戏不想出去玩，又菜又爱搞技（zhuang）术(Bi)，现实生活中社恐，不敢说话，遂建本站。其二原因是微信朋友圈功能过于简陋，不适于发太具有个人情绪或是图文结合的内容，而用Markdown语法写就比较自由，可以肆意整活。其三原因是在朋友圈发内容会打扰到某些看我不顺眼的人或是看到文字就想吐的人，而在这里发就只会让想看的人看到（虽然这种个人博客的最终归宿基本都是因无人问津而废弃，但没有人看我也会更的）。 一些不切实际的期望​ 路过的人或是想看的人给我写条评论吧:joy:，评论区功能我研究了好久才做出来呐。其实我最先做出的是打赏功能。 ​ 反正就是希望我的小站能有人光顾吧，日后会时常维护和美化。 关于技术​ 其实没有什么技术含量，原本想用HTML、CSS、js啥的自己写一个，但前端开发和域名申请都太麻烦，不想搞。想起之前上网时看到了少年班某学长的个人博客（放在左边的链接里了），甚是羡慕，又看到域名有github.io，于是一通搜索资料以后，用github加Hexo加 Icarus主题给自己也搞了一个。总的来说就是套模板，只需要看注释改一点YAML文件里的代码就可以实现。 ​ 可以访问我的github仓库查看详细。 评论区插件​ 运用[畅言云评](畅言云评 - 专业的社会化评论系统 (kuaizhan.com))免费提供的评论插件通过CSS接入实现。 分享按钮​ 通过[AddToAny](AddToAny: Share Buttons by the Universal Sharing Platform)免费提供的分享按钮插件通过CSS接入实现。 logo​ 用Photoshop做的。 目前未完善之处​ 1.左边社交账号部分未将Facebook和Twitter按钮换成其他； ​ 2.上面的归档、分类、标签和About按钮下一片空白，毫无内容； ​ 3.RSS功能未完善（不想付钱，不弄了）； ​ 4.文章太少！ ​ 5.由于github服务器在国外，网页加载很慢，有时需要多刷新几次才能登上（难以解决）。","link":"/2024/03/08/%E5%85%B3%E4%BA%8E%E6%AD%A4%E7%AB%99/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2024/03/08/hello-world/"},{"title":"为什么上课","text":"吐槽某些课程！！！最近被英语QUIZ和某些学科的某些莫名奇妙的作业恶心坏了，不知道为什么要把大把的时间浪费在这些毫无兴趣和意义的事情上。事实上，不管是预科二课程还是我所了解到的本科课程，有一大半纯粹是为了考核而开设，而非学到什么真东西。说实话，要不是为了争那点分数，绝对不会有多少学生去上课。对于大部分同学来说，上课无非是换个更吵闹一点的地方自习，被老师拖着写点作业，搞点分数以助于选专业时有点选择权。更可悲的是，这些课程的考核往往和一个学生的学习水平关系不大，甚至考前一个礼拜开始学都很有可能拿到一个好成绩。它们选拔的不是学习能力强的学生，而是服从安排的学生。 解决事实上，我们早已适应了这种每天被分数逼着去教室吃屎的生活，每个人上课时或多或少都有点自己想干的事情吧。只是最近吃屎吃的比较多，有点恼怒，还是放平心态吧。 不能让自己停止思考一直对计算机感兴趣，但无奈从未系统学习过，只是对着书学了点C++和python，摸了点最基础的算法。搞无聊了，又顺便照着教程弄了个Linux虚拟机玩了玩，但是最终啥也没玩懂，倒是做到能熟练安装VMware Workstation和Ubuntu系统。后来又无聊了，学点JavaScript，HTML和CSS······反正最终是啥都会装，但啥也没学懂。反思了一下，我认为技术是不能脱离于知识的，要改变！ CS61A启动这门伯克利大学开设的课我早已有所了解，据说是最好的计算机入门课，用python语言教学，里面不仅有视频课程，还有各种Homework、有意思的Project、Lab、Textbook······甚至还有离线提交系统，非常适合自学。 虽然里面关于python语言的部分我基本都已掌握，但我依然希望把这门课完完整整地看一遍，算是对我残缺知识体系的补充的开始吧，也希望在里面学点英语（毕竟少班的英语课···懂的都懂）","link":"/2024/03/12/%E4%B8%BA%E4%BB%80%E4%B9%88%E4%B8%8A%E8%AF%BE/"},{"title":"我的报复计划","text":"自由！自由！自由！ 白日莫空过，青春不再来","link":"/2024/03/31/%E6%88%91%E7%9A%84%E6%8A%A5%E5%A4%8D%E8%AE%A1%E5%88%92/"}],"tags":[{"name":"Hello World","slug":"Hello-World","link":"/tags/Hello-World/"},{"name":"吐槽","slug":"吐槽","link":"/tags/%E5%90%90%E6%A7%BD/"},{"name":"碎碎念","slug":"碎碎念","link":"/tags/%E7%A2%8E%E7%A2%8E%E5%BF%B5/"}],"categories":[],"pages":[]}